openFoam/Cas_de_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    side
    {
        type            empty;
        physicalType    empty;
        nFaces          173206;
        startFace       141961;
    }
    airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          555;
        startFace       315167;
    }
    inlet
    {
        type            patch;
        physicalType    inlet;
        nFaces          240;
        startFace       315722;
    }
    outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          67;
        startFace       315962;
    }
)

// ************************************************************************* //
